#pragma once

/* Temporarily disable warnings for thiscall parameter type. */
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wattributes"

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <windows.h>
#include <set>
#include <map>
#include <list>
#include <string>
#include <vector>
#include <algorithm>
#include <unordered_map>

#ifdef __GNUC__
#pragma GCC poison strcat_s strcpy_s
#endif

typedef uint8_t byte;
typedef struct { char str[256]; } char256;

struct CChassis;
extern CChassis* Chassis;
struct CWeapon;
extern CWeapon* Weapon;
struct CArmor;
extern CArmor* Armor;
struct UNIT;
extern UNIT* Units;
struct VEH;
extern VEH* Vehicles;
struct Faction;
extern Faction* Factions;
struct MFaction;
extern MFaction* MFactions;
extern int* const GameState;
extern int* const GameRules;
extern int* const CurrentTurn;
extern int* const ExpansionEnabled;
extern const int MaxVehNum;
extern const int MaxProtoNum;
extern const int MaxPlayerNum;
extern const int MaxBaseSpecNum;
extern const int MaxProtoFactionNum;
extern const int MaxEnemyRange;
bool is_human(int faction_id);
bool can_repair(int unit_id);
bool can_monolith(int unit_id);
bool map_is_known(int faction_id);

#include "engine_enums.h"
#include "engine_types.h"
#include "engine_base.h"
#include "engine_veh.h"
#include "engine_win.h"

struct MapTile {
    int x;
    int y;
    int i;
    MAP* sq;
};

struct TileValue {
    int x;
    int y;
    int i;
    MAP* sq;
    int nutrient;
    int mineral;
    int energy;
};

struct Point {
    int x;
    int y;

    bool operator==(const Point& obj) const {
        return (x == obj.x && y == obj.y);
    }
    bool operator<(const Point& obj) const {
        return x < obj.x || (x == obj.x && y < obj.y);
    }
};

template <>
struct std::hash<Point> {
    std::size_t operator()(const Point& p) const {
        return p.x ^ (p.y << 16);
    }
};

struct MapNode {
    int x;
    int y;
    int type;

    bool operator<(const MapNode& obj) const {
        return x < obj.x || (x == obj.x && (
            y < obj.y || (y == obj.y && (type < obj.type))
        ));
    }
};

template <class T, class C>
bool has_item(const T& a, const C& b) {
    return std::find(a.begin(), a.end(), b) != a.end();
}

template <class T>
const T& min (const T& a, const T& b) {
    return std::min(a, b);
}

template <class T>
const T& max (const T& a, const T& b) {
    return std::max(a, b);
}

template <class T>
const T& clamp (const T& value, const T& low, const T& high) {
    return (value < low ? low : (value > high ? high : value));
}

template <typename T>
int bit_count(T value) {
    static_assert(std::is_integral<T>::value, "integer type required");
    using U = typename std::make_unsigned<T>::type;
    if (sizeof(U) <= sizeof(unsigned int)) {
        return __builtin_popcount(static_cast<unsigned int>(value));
    } else if (sizeof(U) <= sizeof(unsigned long)) {
        return __builtin_popcountl(static_cast<unsigned long>(value));
    } else {
        return __builtin_popcountll(static_cast<unsigned long long>(value));
    }
}

inline TriadFlag operator| (TriadFlag a, TriadFlag b) { return (TriadFlag)((int)a | (int)b); }
inline TriadFlag& operator|= (TriadFlag& a, TriadFlag b) { a = a | b; return a; }
inline VehAblFlag operator| (VehAblFlag a, VehAblFlag b) { return (VehAblFlag)((int)a | (int)b); }
inline VehAblFlag& operator|= (VehAblFlag& a, VehAblFlag b) { a = a | b; return a; }

struct WItem {
    int AI_growth;
    int AI_tech;
    int AI_wealth;
    int AI_power;
    int AI_fight;
};

struct BItem {
    int item_id;
    int explore;
    int discover;
    int build;
    int conquer;
    int energy;
};

struct PInfo {
    int former;
    int safety;
    int target;
    int roads;
    int flags;
    int unit_near;
    int unit_path;
    int enemy;
    int enemy_near;
    int enemy_dist;
    int enemy_rank;
    int overlay;

    int get_enemy_dist() const {
        return (enemy_dist > 0 ? enemy_dist : MaxEnemyRange/2);
    }
};

typedef std::unordered_map<Point, PInfo> PMTable;
typedef std::set<MapNode> NodeSet;
typedef std::set<Point> Points;
typedef std::vector<Point> PointList;
typedef std::set<std::string> set_str_t;
typedef std::vector<std::string> vec_str_t;
typedef std::map<std::string, std::string> map_str_t;
typedef std::map<int, int> map_int_t;

typedef int (__cdecl *fp_none)();
typedef int (__cdecl *fp_1int)(int);
typedef int (__cdecl *fp_2int)(int, int);
typedef int (__cdecl *fp_3int)(int, int, int);
typedef int (__cdecl *fp_4int)(int, int, int, int);
typedef int (__cdecl *fp_5int)(int, int, int, int, int);
typedef int (__cdecl *fp_6int)(int, int, int, int, int, int);
typedef int (__cdecl *fp_7int)(int, int, int, int, int, int, int);
typedef int (__cdecl *fp_8int)(int, int, int, int, int, int, int, int);

typedef int (__thiscall *tc_1int)(void*);
typedef int (__thiscall *tc_2int)(void*, int);
typedef int (__thiscall *tc_3int)(void*, int, int);
typedef int (__thiscall *tc_4int)(void*, int, int, int);
typedef int (__thiscall *tc_5int)(void*, int, int, int, int);
typedef int (__thiscall *tc_6int)(void*, int, int, int, int, int);
typedef int (__thiscall *tc_7int)(void*, int, int, int, int, int, int);
typedef int (__thiscall *tc_8int)(void*, int, int, int, int, int, int, int);

/*
pad_1 in MFaction is reserved for faction specific variables.
pad_2 in MFaction[0] is reserved for global game state.
*/
struct ThinkerData {
    uint64_t reserved;
    uint64_t game_time_spent;
    char build_date[12];
    uint32_t map_random_value;
    int8_t padding[144];
};

static_assert(sizeof(struct CTerraform) == 32, "");
static_assert(sizeof(struct CResourceInfo) == 144, "");
static_assert(sizeof(struct CCitizen) == 28, "");
static_assert(sizeof(struct CResourceName) == 8, "");
static_assert(sizeof(struct CCombatMode) == 16, "");
static_assert(sizeof(struct CBonusName) == 24, "");
static_assert(sizeof(struct CCombatMode) == 16, "");
static_assert(sizeof(struct CRules) == 308, "");
static_assert(sizeof(struct CEnergy) == 8, "");
static_assert(sizeof(struct CChassis) == 144, "");
static_assert(sizeof(struct CNatural) == 8, "");
static_assert(sizeof(struct CWeapon) == 16, "");
static_assert(sizeof(struct CSocialCategory) == 16, "");
static_assert(sizeof(struct CSocialEffect) == 44, "");
static_assert(sizeof(struct CSocialParam) == 104, "");
static_assert(sizeof(struct CSocialField) == 212, "");
static_assert(sizeof(struct CMight) == 8, "");
static_assert(sizeof(struct CTimeControl) == 32, "");
static_assert(sizeof(struct CArmor) == 16, "");
static_assert(sizeof(struct CTech) == 44, "");
static_assert(sizeof(struct CWorldbuilder) == 124, "");
static_assert(sizeof(struct CMorale) == 8, "");
static_assert(sizeof(struct CReactor) == 12, "");
static_assert(sizeof(struct COrder) == 12, "");
static_assert(sizeof(struct CFacility) == 48, "");
static_assert(sizeof(struct CProposal) == 12, "");
static_assert(sizeof(struct CAbility) == 28, "");
static_assert(sizeof(struct MFaction) == 1436, "");
static_assert(sizeof(struct Faction) == 8396, "");
static_assert(sizeof(struct BASE) == 308, "");
static_assert(sizeof(struct UNIT) == 52, "");
static_assert(sizeof(struct VEH) == 52, "");
static_assert(sizeof(struct MAP) == 44, "");
static_assert(sizeof(struct Monument) == 1268, "");
static_assert(sizeof(struct ReplayEvent) == 8, "");
static_assert(sizeof(struct ThinkerData) == 176, "");

/*
Thinker functions that are replacements to the SMACX binary versions
should be prefixed with 'mod_' if their equivalent is also listed here.
*/

extern const char** const EngineVersion;
extern const char** const EngineDate;
extern char* const LastSavePath;
extern char* const MapFilePath;
extern char* const StrBuffer;
extern BASE** const CurrentBase;
extern int* const CurrentBaseID;
extern int* const ComputeBaseID;
extern int* const BaseUpkeepDrawID;
extern int* const BaseReservedTiles;
extern int* const BaseFindDist;
extern int* const BaseGrowthRate;
extern int* const BaseUpkeepFlag;
extern int* const BaseUpkeepState;
extern int* const BasePsychTalents;
extern int* const BasePsychNDrones;
extern int* const BasePsychSDrones;
extern int* const BaseTileFlags;
extern int* const BaseResourceConvoyFrom;
extern int* const BaseResourceConvoyTo;
extern int* const BaseVehPacifismCount;
extern int* const BaseForcesSupported;
